In [1]:
import numpy as np
import pandas as pd

In [3]:
series=pd.Series([10,20,30])
series

0    10
1    20
2    30
dtype: int64

In [6]:
temp=pd.Series(["Kavi","Shyam","Ram"],index=[3,5,1])
temp

3     Kavi
5    Shyam
1      Ram
dtype: object

In [12]:
e=np.array([1,2,3,4])
pd.Series(e,index=['Jan',"Feb","Mar","Apr"])

Jan    1
Feb    2
Mar    3
Apr    4
dtype: int32

In [13]:
pd.Series(e)

0    1
1    2
2    3
3    4
dtype: int32

In [14]:
a={"prajjwal":[1,3,13]}
pd.Series(a)

prajjwal    [1, 3, 13]
dtype: object

In [16]:
country={"India":"New Delhi","England":"London","Japan":"Tokyo"}
tp=pd.Series(country)

In [18]:
tp.head(2)

India      New Delhi
England       London
dtype: object

In [19]:
tp[0:1]

India    New Delhi
dtype: object

In [20]:
tp["India"]

'New Delhi'

In [25]:
arr=np.array([[2,3],[14,3]])

In [28]:
rp=pd.Series(arr[0])

In [31]:
rp

0    2
1    3
dtype: int32

In [34]:
rta=pd.Series([2,243,4],index=[2,1,24])

In [36]:
rta[0:2]=90

In [37]:
rta

2     90
1     90
24     4
dtype: int64

In [38]:
people={"age":[23,19,17],"name":["Harper","Evan","Dustin"]}
roy=pd.DataFrame(people)
roy

   age    name
0   23  Harper
1   19    Evan
2   17  Dustin

In [43]:
students={"Arnab":[90,91,97],"Ramit":[92,81,96],"Samridhi":[89,91,88],"Riya":[81,71,67],"Mallika":[94,95,99]}
pd.DataFrame(students,index=["Maths","Science","Hinid"])

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hinid       97     96        88    67       99

In [48]:
one=np.array([1,23])
two=np.array([12,41])
three=np.array([241,24])

temp=pd.DataFrame([one,two,three],columns=[14,14])

In [41]:
kim=[["Kim","Dom"],["Ken","Ryan"],["Jack","Martin"],]
pd.DataFrame(kim)

      0       1
0   Kim     Dom
1   Ken    Ryan
2  Jack  Martin

In [45]:
temp=[{"name":"Finn","age":23},{"name":"Kimmy","age":89}]
pd.DataFrame(temp)

    name  age
0   Finn   23
1  Kimmy   89

In [46]:
d = {'one' : pd.Series([10, 20, 30, 40],
                       index =['a', 'b', 'c', 'd']),
      'two' : pd.Series([10, 20, 30, 40],
                        index =['a', 'b', 'c', 'd'])}
  

df = pd.DataFrame(d)

In [49]:
{[]}

    14  14
0    1  23
1   12  41
2  241  24